IdeaRS.Connections
TimberGussetPlateData Properties
Compatible with IDEA StatiCa 0.0
The TimberGussetPlateData type exposes the following members.
Properties
Name | Description
BoltShearType
CountOfGussetPlates
CountOfMembers
GussetPlateSurfaceOffset
IsActive |  (Inherited from ConnectionCmdData.)
Name
 Gets or set the name
 (Inherited from ConnectionCmdData.)
OperationId
 Gets or sets the identifier of the operation in the manufacturer sequence
 (Inherited from ConnectionCmdData.)
PlateMaterialName
 Gets or sets the name of the material If value is null or empty material is taken from column
 (Inherited from PlateDataBase.)
ShapeData
 Collection of plate editor data
 (Inherited from PlateDataBase.)
ShearPlaneThread
SinglePlateExtension
Thickness
 Gets or sets the thickness of the plate
 (Inherited from PlateDataBase.)
TimberGussetMembers
TimberGussetPlateType
Top
See Also
Reference
TimberGussetPlateData Class
IdeaRS.Connections.Data Namespace